---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedAndConceptualModels
source: html/7b6a465d-2294-4b71-29ea-b96fe55dd395.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisDetailedAndConceptualModels Property

Essential.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisDetailedAndConceptualModels { get; }
```